import s from './EndScreen.module.css'

interface Score{
    score: number
}


const EndScreen = ( { score }: Score ) => {

    const percent20 = (score: number) => {
        return (
            <div className={s.Wrapper}>
                <h2 className={s.Title}>Упс! Что-то пошло не так... 🙈</h2>
                <h1 className={s.Score20}>{score}/10</h1>
                <h3 className={s.StatusText}>Ваш статус: <span className={s.Status20}>«Счастливый созерцатель»</span></h3>
                <p className={s.Text}>
                    Похоже, сегодня вы решили поберечь свою память для 
                    более важных дел. Ничего страшного! Эрудиция — штука 
                    наживная, зато теперь вы знаете пару новых любопытных 
                    фактов. Стоит немного подучиться, и в следующий раз вы всех удивите!
                </p>
            </div>
        )
    }

    const percent50 = (score: number) => {
        return (
            <div className={s.Wrapper}>
                <h2 className={s.Title}>Хорошее начало! 🐾</h2>
                <h1 className={s.Score50}>{score}/10</h1>
                <h3 className={s.StatusText}>Ваш статус: <span className={s.Status50}>«Искатель истин»</span></h3>
                <p className={s.Text}>
                    Вы уже на пути к званию мудреца! У вас 
                    неплохо получается ориентироваться в разных 
                    темах, хотя в некоторых вопросах удача 
                    отвернулась. Результат уже неплохой, но мы-то 
                    знаем, что вы способны на большее. Попробуем еще раз?
                </p>
            </div>
        )
    }

    const percent80 = (score: number) => {
        return (
            <div className={s.Wrapper}>
                <h2 className={s.Title}>Вот это мощь! 🧠✨</h2>
                <h1 className={s.Score80}>{score}/10</h1>
                <h3 className={s.StatusText}>Ваш статус: <span className={s.Status80}>«Мастер эрудиции»</span></h3>
                <p className={s.Text}>
                    Отличный результат! Вы чувствуете себя как рыба 
                    в воде в самых разных вопросах. С таким кругозором 
                    можно смело идти на любое интеллектуальное шоу. 
                    Еще совсем чуть-чуть внимательности — и вы заберете золотой кубок!
                </p>
            </div>
        )
    }

    const percent100 = (score: number) => {
        return (
            <div className={s.Wrapper}>
                <h2 className={s.Title}>Просто космос! 🚀👑</h2>
                <h1 className={s.Score100}>{score}/10</h1>
                <h3 className={s.StatusText}>Ваш статус: <span className={s.Status100}>«Человек-Гугл»</span></h3>
                <p className={s.Text}>
                    Потрясающе! Вы выдали отличный результат и разнесли 
                    этот тест в пух и прах. Вашему кругозору можно 
                    только позавидовать — кажется, для вас нет закрытых 
                    тем. Вы настоящий эксперт во всем и сразу!
                </p>
            </div>
        )
    }

    const toReturn = (score: number) => {
        if(score <= 2) {
            return percent20(score)
        } else if (score <= 5) {
            return percent50(score)
        } else if (score <= 8) {
            return percent80(score)
        } else {
            return percent100(score)
        }
    }

    return (
        toReturn(score)
    )
}

export default EndScreen